app/views/users/show.html.erb

SELECT "ratings".* FROM "ratings" WHERE "ratings"."user_id" = 2
SELECT COUNT(*) FROM "ratings" WHERE "ratings"."user_id" = 3
---
  <tr>
    <p> has given <%= pluralize(@user.ratings.count, 'rating') %>