app/views/breweries/show.html.erb


<p> Number of beers: <%= @brewery.beers.count %> </p>
---
SELECT "beers".* FROM "beers" WHERE "beers"."brewery_id" = 1
SELECT COUNT(*) FROM "beers" WHERE "beers"."brewery_id" = 1

<p>
<% if @brewery.ratings.empty? %>
---
SELECT "ratings".* FROM "ratings" INNER JOIN "beers" ON "ratings"."beer_id" = "beers"."id" WHERE "beers"."brewery_id" = 1
SELECT COUNT(*) FROM "ratings" INNER JOIN "beers" ON "ratings"."beer_id" = "beers"."id" WHERE "beers"."brewery_id" = 1