app/views/beers/show.html.erb

<p>
<% if @beer.ratings.empty? %>
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."beer_id" = 1
SELECT COUNT(*) FROM "ratings" WHERE "ratings"."beer_id" = 1