app/controllers/beers_controller.rb

  def index
    @beers = Beer.all.sort_by{ |b| b.send(params[:order] || 'name') }
---
SELECT "beers".* FROM "beers"

  def show
    @beer = Beer.find(params[:id])
---
SELECT "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT 1  [["id", "1"]]

  def new
    @beer = Beer.new
    @breweries = Brewery.all
---
SELECT "breweries".* FROM "breweries"

  def edit
    @beer = Beer.find(params[:id])
---
SELECT "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT 1  [["id", "10"]]

  def create
    @beer = Beer.new(params[:beer])

    respond_to do |format|
      if @beer.save
---
INSERT INTO "beers" ("brewery_id", "created_at", "name", "style", "updated_at") VALUES (?, ?, ?, ?, ?)  [["brewery_id", 2], ["created_at", Wed, 08 Jan 2014 14:28:44 UTC +00:00], ["name", "JÖÖ"], ["style", "hmm"], ["updated_at", Wed, 08 Jan 2014 14:28:44 UTC +00:00]]

  def destroy
    @beer = Beer.find(params[:id])
    @beer.destroy
---
SELECT "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT 1  [["id", "9"]]
DELETE FROM "beers" WHERE "beers"."id" = ?  [["id", 9]]