app/controllers/ratings_controller.rb

  def index
  	@ratings = Rating.all
---
SELECT "ratings".* FROM "ratings"

  def new
  	@rating = Rating.new
    @beers = Beer.all
---
SELECT "beers".* FROM "beers"

def create
  @rating = Rating.new params[:rating]

  if @rating.save
    current_user.ratings << @rating
    redirect_to user_path current_user
  else
    @beers = Beer.all
---
INSERT INTO "ratings" ("beer_id", "created_at", "score", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["beer_id", 8], ["created_at", Thu, 09 Jan 2014 20:39:20 UTC +00:00], ["score", 11], ["updated_at", Thu, 09 Jan 2014 20:39:20 UTC +00:00], ["user_id", nil]]
SELECT "beers".* FROM "beers"

  def destroy
    rating = Rating.find params[:id]
    rating.delete if current_user == rating.user
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."id" = ? LIMIT 1  [["id", "7"]]
DELETE FROM "ratings" WHERE "ratings"."id" = 7