app/controllers/sessions_controller.rb

    def create
      user = User.where(:username => params[:username]).first
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'atomim' LIMIT 1