app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "username") VALUES (?, ?, ?)  [["created_at", Thu, 09 Jan 2014 18:12:23 UTC +00:00], ["updated_at", Thu, 09 Jan 2014 18:12:23 UTC +00:00], ["username", "atomim"]]
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "9"]]
UPDATE "users" SET "password_digest" = '$2a$10$EyzT9EIj0kPnCS6k1ntGb.krt2CIom6qSZCdEkB3UaAYYvdmaskTe', "updated_at" = '2014-01-09 23:01:24.147329' WHERE "users"."id" = 9
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if params[:user][:username].nil? and currently_signed_in? @user and @user.update_attributes(params[:user])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
  def destroy
    @user = User.find(params[:id])
    if currently_signed_in?(@user)
      @user.destroy